  SORT FIELDS=(7,15,CH,A)                                               00010000
  OUTREC OVERLAY=(27:C'P')                                              00020000
