       IDENTIFICATION DIVISION.
       PROGRAM-ID. CA21G132.
       DATA DIVISION.
       LINKAGE SECTION.
       77 LK-MARKS      PIC 9(2)V9(3).
       77 LK-PERCENTAGE PIC 9(2).
       PROCEDURE DIVISION USING LK-MARKS LK-PERCENTAGE.
           COMPUTE LK-PERCENTAGE ROUNDED = LK-MARKS / 50 * 100
           GOBACK.
