  SORT FIELDS=COPY                                                      00010000
  OUTREC FIELDS=(27,8,X,1,21,6X,36,10)                                  00020000
