  SORT FIELDS=COPY,SKIPREC(1)                                           00010000
  OUTREC FIELDS=(1,3,X,17,1,X,5,3,X,9,7,X,19,5)                         00020000
