  SORT FIELDS=(1,3,CH,A)                                                00010000
  SUM FIELDS=(7,3,ZD)                                                   00020000
