  SORT FIELDS=COPY                                                      00010000
  OUTREC OVERLAY=(3:2,23,1:C'M-')                                       00020000
