       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBEX02.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-EMP.
           02 WS-EMP-NAME     PIC X(20).
           02 WS-EMP-EMAIL-ID PIC X(34).
       PROCEDURE DIVISION.
       0000-MAIN-PARA.
           PERFORM 1000-INITIALIZE-PARA THRU
                   1000-INITIALIZE-PARA-EXIT
           PERFORM 2000-PROCESS-PARA THRU
                   2000-PROCESS-PARA-EXIT
           PERFORM 9000-TERMINATION-PARA THRU
                   9000-TERMINATION-PARA-EXIT.
       0000-MAIN-PARA-EXIT.
           EXIT.
       1000-INITIALIZE-PARA.
           INITIALIZE WS-EMP.
       1000-INITIALIZE-PARA-EXIT.
           EXIT.
       2000-PROCESS-PARA.
           ACCEPT WS-EMP-NAME.
           CALL 'COBEX02S' USING WS-EMP.
           DISPLAY "EMPLOYEE NAME : " WS-EMP-NAME.
           DISPLAY "EMPLOYEE EMAIL: " WS-EMP-EMAIL-ID.
       2000-PROCESS-PARA-EXIT.
           EXIT.
       9000-TERMINATION-PARA.
           STOP RUN.
       9000-TERMINATION-PARA-EXIT.
           EXIT.