       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBEX03.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WS-EMP-SALARY-BASIC        PIC 9(6)V9(2).
       77 WS-DA                      PIC 9(6)V9(2).
       77 WS-HRA                     PIC 9(6)V9(2).
       77 WS-MA                      PIC 9(6)V9(2).
       77 WS-TOTAL-SALARY            PIC 9(7)V9(2).
       77 WS-EMP-SALARY-BASIC-EDITED PIC ZZZZZZ.ZZ.
       77 WS-TOTAL-SALARY-EDITED     PIC ZZZZZZZ.ZZ.
       PROCEDURE DIVISION.
       0000-MAIN-PARA.
           PERFORM 1000-INITIALIZE-PARA THRU
                   1000-INITIALIZE-PARA-EXIT
           PERFORM 2000-PROCESS-PARA THRU
                   2000-PROCESS-PARA-EXIT
           PERFORM 9000-TERMINATION-PARA THRU
                   9000-TERMINATION-PARA-EXIT.
       0000-MAIN-PARA-EXIT.
           EXIT.
       1000-INITIALIZE-PARA.
           INITIALIZE WS-EMP-SALARY-BASIC WS-DA WS-HRA WS-MA
                      WS-TOTAL-SALARY WS-EMP-SALARY-BASIC-EDITED
                      WS-TOTAL-SALARY-EDITED.
       1000-INITIALIZE-PARA-EXIT.
           EXIT.
       2000-PROCESS-PARA.
           ACCEPT WS-EMP-SALARY-BASIC.
           CALL 'COBEX03S' USING WS-EMP-SALARY-BASIC WS-DA WS-HRA
                                 WS-MA WS-TOTAL-SALARY
                                 WS-EMP-SALARY-BASIC-EDITED
                                 WS-TOTAL-SALARY-EDITED.
           DISPLAY "EMPLOYEE BASIC SALARY : "
                   WS-EMP-SALARY-BASIC-EDITED.
           DISPLAY "EMPLOYEE TOTAL SALARY : " WS-TOTAL-SALARY-EDITED.
       2000-PROCESS-PARA-EXIT.
           EXIT.
       9000-TERMINATION-PARA.
           STOP RUN.
       9000-TERMINATION-PARA-EXIT.
           EXIT.