       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBEX01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WS-STRING      PIC A(1000).
       77 WS-STRING-LEN  PIC 9(04).
       PROCEDURE DIVISION.
       0000-MAIN-PARA.
           PERFORM 1000-INITIALIZE-PARA THRU
                   1000-INITIALIZE-PARA-EXIT
           PERFORM 2000-PROCESS-PARA THRU
                   2000-PROCESS-PARA-EXIT
           PERFORM 9000-TERMINATION-PARA THRU
                   9000-TERMINATION-PARA-EXIT.
       0000-MAIN-PARA-EXIT.
           EXIT.
       1000-INITIALIZE-PARA.
           INITIALIZE WS-STRING WS-STRING-LEN.
       1000-INITIALIZE-PARA-EXIT.
           EXIT.
       2000-PROCESS-PARA.
           ACCEPT WS-STRING.
           CALL 'COBEX01S' USING WS-STRING WS-STRING-LEN.
           DISPLAY "INPUT STRING IS : " WS-STRING.
           DISPLAY "STRING LENGTH IS : " WS-STRING-LEN.
       2000-PROCESS-PARA-EXIT.
           EXIT.
       9000-TERMINATION-PARA.
           STOP RUN.
       9000-TERMINATION-PARA-EXIT.
           EXIT.