       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBEX01S.
       DATA DIVISION.
       LINKAGE SECTION.
       77 WS-STRING      PIC A(1000).
       77 WS-STRING-LEN  PIC 9(04).
       PROCEDURE DIVISION USING WS-STRING WS-STRING-LEN.
       0000-MAIN-PARA.
           PERFORM 1000-INITIALIZE-PARA THRU
                   1000-INITIALIZE-PARA-EXIT
           PERFORM 2000-PROCESS-PARA THRU
                   2000-PROCESS-PARA-EXIT
           PERFORM 9000-TERMINATION-PARA THRU
                   9000-TERMINATION-PARA-EXIT.
       0000-MAIN-PARA-EXIT.
           EXIT.
       1000-INITIALIZE-PARA.
           EXIT.
       1000-INITIALIZE-PARA-EXIT.
           EXIT.
       2000-PROCESS-PARA.
           PERFORM 3000-CAL-PARA THRU
                   3000-CAL-PARA-EXIT.
       2000-PROCESS-PARA-EXIT.
           EXIT.
       3000-CAL-PARA.
           INSPECT FUNCTION REVERSE(WS-STRING) TALLYING WS-STRING-LEN
           FOR LEADING SPACES.
           COMPUTE WS-STRING-LEN = LENGTH OF WS-STRING - WS-STRING-LEN.
       3000-CAL-PARA-EXIT.
           EXIT.
       9000-TERMINATION-PARA.
           GOBACK.
       9000-TERMINATION-PARA-EXIT.
           EXIT.