       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBEX05M.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WS-NUM         PIC 9(3).
       77 WS-SQUARE-NUM  PIC 9(6).
       PROCEDURE DIVISION.
       0000-MAIN-PARA.
           PERFORM 1000-INITIALIZE-PARA THRU
                   1000-INITIALIZE-PARA-EXIT
           PERFORM 2000-PROCESS-PARA THRU
                   2000-PROCESS-PARA-EXIT
           PERFORM 9000-TERMINATION-PARA THRU
                   9000-TERMINATION-PARA-EXIT.
       0000-MAIN-PARA-EXIT.
           EXIT.
       1000-INITIALIZE-PARA.
           INITIALIZE WS-SQUARE-NUM WS-NUM.
       1000-INITIALIZE-PARA-EXIT.
           EXIT.
       2000-PROCESS-PARA.
           ACCEPT WS-NUM.
           CALL 'COBEX05S' USING WS-NUM WS-SQUARE-NUM.
           DISPLAY "INPUT NUMBER        :" WS-NUM.
           DISPLAY "INPUT SQUARE NUMBER :" WS-SQUARE-NUM.
       2000-PROCESS-PARA-EXIT.
           EXIT.
       9000-TERMINATION-PARA.
           STOP RUN.
       9000-TERMINATION-PARA-EXIT.
           EXIT.