       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBEX04S.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WS-ACC-NUMBER-LEN     PIC 9(2).
       LINKAGE SECTION.
       77 LK-ACC-NUMBER         PIC X(10).
       77 LK-ACC-HOLDER-NAME    PIC X(20).
       77 LK-ACC-TYPE           PIC X(10).
       PROCEDURE DIVISION USING LK-ACC-NUMBER LK-ACC-HOLDER-NAME
                                LK-ACC-TYPE.
       0000-MAIN-PARA.
           PERFORM 1000-INITIALIZE-PARA THRU
                   1000-INITIALIZE-PARA-EXIT
           PERFORM 2000-PROCESS-PARA THRU
                   2000-PROCESS-PARA-EXIT
           PERFORM 9000-TERMINATION-PARA THRU
                   9000-TERMINATION-PARA-EXIT.
       0000-MAIN-PARA-EXIT.
           EXIT.
       1000-INITIALIZE-PARA.
           INITIALIZE WS-ACC-NUMBER-LEN.
       1000-INITIALIZE-PARA-EXIT.
           EXIT.
       2000-PROCESS-PARA.
           PERFORM 3000-VAL-PARA THRU
                   3000-VAL-PARA-EXIT.
       2000-PROCESS-PARA-EXIT.
           EXIT.
       3000-VAL-PARA.
           INSPECT FUNCTION REVERSE(LK-ACC-NUMBER) TALLYING
           WS-ACC-NUMBER-LEN FOR LEADING SPACES.
           COMPUTE WS-ACC-NUMBER-LEN = LENGTH OF LK-ACC-NUMBER -
                   WS-ACC-NUMBER-LEN.
           IF WS-ACC-NUMBER-LEN = 10 AND
              ( LK-ACC-TYPE = "SAVINGS" OR LK-ACC-TYPE = "CURRENT" )
              AND LK-ACC-HOLDER-NAME IS ALPHABETIC
              DISPLAY LK-ACC-NUMBER LK-ACC-HOLDER-NAME LK-ACC-TYPE
           END-IF.
       3000-VAL-PARA-EXIT.
           EXIT.
       9000-TERMINATION-PARA.
           GOBACK.
       9000-TERMINATION-PARA-EXIT.
           EXIT.