//KSDSCRT    PROC                                                       00010000
//STEP001    EXEC PGM=IDCAMS                                            00020000
//SYSOUT     DD   SYSOUT=*                                              00030000
//SYSPRINT   DD   SYSOUT=*                                              00040000
//SYSIN      DD   DSN=TECN123.VSAM.CC01.PDS(CTL01),DISP=SHR             00050000