//TCOM018@ JOB NOTIFY=&SYSUID
//JOBLIB   DD DSN=TCOM018.MYLIB.LOADLIB,DISP=SHR
//STEP1    EXEC PGM=COBEX04
//INCUSPS  DD DSN=TCOM018.MYLIB.COB07.EX04.PS1,DISP=SHR
//SYSIN    DD *
/*
