//TCOM018@ JOB NOTIFY=&SYSUID
//JOBLIB   DD DSN=TCOM018.MYLIB.LOADLIB,DISP=SHR
//STEP1    EXEC PGM=COBEX01
//SYSIN    DD *
090
080
085
078
095
/*
