//TCOM018@ JOB NOTIFY=&SYSUID
//JOBLIB DD DSN=TCOM018.MYLIB.LOADLIB,DISP=SHR
//STEP1 EXEC PGM=COBEX03
//SYSIN DD *
KANNAN
EMP12
10000.00
RAVI SHANKAR
EMP13
15000.00
TEEJA SHREE
EMP14
10000.00
GOKUL RAJ
EMP15
30000.00
SANGEETHA
EMP16
10000.00
KANNAN
/*
