//TCOM018@ JOB NOTIFY=&SYSUID
//JOBLIB DD DSN=TCOM018.MYLIB.LOADLIB,DISP=SHR
//STEP1 EXEC PGM=COBEX02
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
567
/*
