//TECN132A JOB NOTIFY=&SYSUID
//SET SET EX=COBEX01
//STEP01 EXEC IGYWCL
//SYSPRINT     DD SYSOUT=*
//COBOL.SYSIN  DD DSN=TECN132.MYLIB.COB03(&EX),DISP=OLD
//LKED.SYSLMOD DD DSN=TECN132.MYLIB.LOADLIB(&EX),DISP=OLD
//STEPLIB      DD DSN=TECN132.MYLIB.LOADLIB,DISP=SHR
//SYSIN        DD DUMMY
/*
//