//TEKUSR0Z JOB NOTIFY=&SYSUID
//SET SET EX=COBEX06
//STEP01 EXEC IGYWCL
//SYSPRINT DD SYSOUT=*
//COBOL.SYSIN DD DSN=TEKUS00.MYLIB.COB04(&EX),DISP=SHR
//LKED.SYSLMOD DD DSN=TEKUS00.MYLIB.LOADLIB(&EX),DISP=SHR
//STEP02 EXEC PGM=&EX
//STEPLIB DD DSN=TEKUS00.MYLIB.LOADLIB,DISP=SHR
//SYSIN DD *
6000000
1000000
4550000
0500000
1300000
0500000
0100000
/*